# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.22-s017_1 on Wed Jun 17 11:51:46 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design systolic_arr_2x2

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports valid_in]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports valid_out]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe00_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe01_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe10_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {pe11_out[0]}]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells typical/HOLDX1]
